# IntegerRange Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IntegerRange Properties
IntegerRange Class See Also
---
The IntegerRange type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| High | The upper limit of the range |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Low | The lower limit of the range |

# See Also
IntegerRange Class
Autodesk.Revit.DB Namespace